src/cf/Documents/_5LB_ПлановоеПоступление.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>_5LB_ПлановоеПоступление</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбщийВес</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Перевозчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Кладовщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОтгрузки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладРеализации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладПоступления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Comment>КонтрагентРеализации</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КурсВзаиморасчетов</Name>
					<Comment>(Общ) </Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КратностьВзаиморасчетов</Name>
					<Comment>(Общ) </Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЗаказыПокупателей</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Заказ</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВесЗаказа</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатусСборки</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтатусыСборкиЗаказа</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Штрихкод</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>13</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПринятоНаРц</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/InformationRegisters/ШтрихкодыЗаказы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ШтрихкодыЗаказы</Name>
			<Comment>(Общ)</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Штрихкод</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ТипыШтрихкодов</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Владелец</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровОтПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипШтрихкода</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ТипыШтрихкодов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/Заказы4Logistic.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>Заказы4Logistic</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Время</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Метро</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АдресДоставки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Округ</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Округ</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Зона</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Телефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Срочность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекстЗадачи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФИО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Вес</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Затраты</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПрочиеЗатраты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НаселённыйПункт</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Улица</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Дом</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Корпус</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Строение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Подъезд</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Квартира</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Индекс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>7</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>email</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Страна</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторСтранМира</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Documents/_5LB_ПлановоеПоступление/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
//#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	ЗаполнениеДокументов.ЗаполнитьШапкуДокумента(ЭтотОбъект, глЗначениеПеременной("глТекущийПользователь"));
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
	КонецЕсли;
	
	КурсВзаиморасчетов = 1;
	КратностьВзаиморасчетов = 1;
	
КонецПроцедуры

Процедура  ЗаполнитьСтрокуТЧ(СтрокаТЗ) Экспорт
	
Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаказПокупателя.Ссылка КАК Заказ
		|ПОМЕСТИТЬ ВТ_Заказ
		|ИЗ
		|	Документ.ЗаказПокупателя КАК ЗаказПокупателя
		|ГДЕ
		|	ЗаказПокупателя.Ссылка = &Заказ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ШтрихкодыЗаказы.Штрихкод,
		|	ШтрихкодыЗаказы.Владелец
		|ПОМЕСТИТЬ ВТ_Штрихкод
		|ИЗ
		|	РегистрСведений.ШтрихкодыЗаказы КАК ШтрихкодыЗаказы
		|ГДЕ
		|	ШтрихкодыЗаказы.Владелец = &Заказ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Заказы4Logistic.Заказ,
		|	ЕСТЬNULL(Заказы4Logistic.Вес, 0) КАК Вес
		|ПОМЕСТИТЬ ВТ_Вес
		|ИЗ
		|	РегистрСведений.Заказы4Logistic КАК Заказы4Logistic
		|ГДЕ
		|	Заказы4Logistic.Заказ = &Заказ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Заказ.Заказ,
		|	ВТ_Штрихкод.Штрихкод,
		|	ВТ_Вес.Вес
		|ИЗ
		|	ВТ_Заказ КАК ВТ_Заказ
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Штрихкод КАК ВТ_Штрихкод
		|		ПО ВТ_Заказ.Заказ = ВТ_Штрихкод.Владелец
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Вес КАК ВТ_Вес
		|		ПО ВТ_Заказ.Заказ = ВТ_Вес.Заказ";
		
		Запрос.УстановитьПараметр("Заказ",СтрокаТЗ.Заказ.Ссылка);
		
		Рез=Запрос.Выполнить();
		
		Если НЕ Рез.Пустой() Тогда
			
			Выборка = Рез.Выбрать();
		    Выборка.Следующий();
			СтрокаТЗ.СтатусСборки = СтрокаТЗ.Заказ.СтатусыСборкиЗаказа;
			СтрокаТЗ.Сумма  = СтрокаТЗ.Заказ.СуммаДокумента;
			СтрокаТЗ.Штрихкод = Выборка.Штрихкод;
			СтрокаТЗ.ВесЗаказа  = Выборка.Вес;
			
		КонецЕсли;
		
КонецПроцедуры
//#КонецОбласти
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	ЗаполнениеДокументов.ЗаполнитьШапкуДокумента(ЭтотОбъект, глЗначениеПеременной("глТекущийПользователь"));
	
КонецПроцедуры

#Область Печать

// Возвращает доступные варианты печати документа
//
// Вовращаемое значение:
//  Струткура, каждая строка которой соответствует одному из вариантов печати
//  
Функция ПолучитьСтруктуруПечатныхФорм() Экспорт
	
	СтруктураМакетов = Новый Структура;
	СтруктураМакетов.Вставить("АктПриемаПередачиТМЦ","Акт приема передачи ТМЦ");
	Возврат СтруктураМакетов;

КонецФункции // ПолучитьСтруктуруПечатныхФорм()

// Процедура осуществляет печать документа. Можно направить печать на 
// экран или принтер, а также распечатать необходмое количество копий.
//
//  Название макета печати передается в качестве параметра,
// по переданному названию находим имя макета в соответствии.
//
// Параметры:
//  НазваниеМакета - строка, название макета.
//
Процедура Печать(ИмяМакета, КоличествоЭкземпляров = 1, НаПринтер = Ложь) Экспорт

	Если ЭтоНовый() Тогда
		
	    СообщениеП = Новый СообщениеПользователю;
		СообщениеП.Текст = "Документ можно распечатать только после его проведения";
		СообщениеП.Сообщить();
		
		Возврат;
		
	ИначеЕсли Не УправлениеДопПравамиПользователей.РазрешитьПечатьНепроведенныхДокументов(Проведен) Тогда
		
		СообщениеП = Новый СообщениеПользователю;
		СообщениеП.Текст = "Документ можно распечатать только после его проведения";
		СообщениеП.Сообщить();
		
		Возврат;
		
	КонецЕсли;

	//Если Не РаботаСДиалогами.ПроверитьМодифицированность(ЭтотОбъект) Тогда
	//	Возврат;
	//КонецЕсли;

	Если ИмяМакета = "АктПриемаПередачиТМЦ" тогда

		ТабДокумент = ПечатьАктПриемаПередачиТМЦ();

		КонецЕсли;

	УниверсальныеМеханизмы.НапечататьДокумент(ТабДокумент, КоличествоЭкземпляров, НаПринтер, ОбщегоНазначения.СформироватьЗаголовокДокумента(ЭтотОбъект));

КонецПроцедуры

Функция ПечатьАктПриемаПередачиТМЦ()
	
	Макет = ПолучитьМакет("АктПриемаПередачиТМЦ");
	
	   Запрос =  Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	_5LB_ПлановоеПоступлениеЗаказыПокупателей.Заказ
		|ПОМЕСТИТЬ ВТ_Заказы
		|ИЗ
		|	Документ._5LB_ПлановоеПоступление.ЗаказыПокупателей КАК _5LB_ПлановоеПоступлениеЗаказыПокупателей
		|ГДЕ
		|	_5LB_ПлановоеПоступлениеЗаказыПокупателей.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗаказПокупателяТовары.Количество,
		|	ЗаказПокупателяТовары.Ссылка.Номер КАК НомерЗаказа,
		|	ВЫРАЗИТЬ(ЗаказПокупателяТовары.Номенклатура.Наименование КАК СТРОКА(1024)) КАК Номенклатура,
		|	ВЫРАЗИТЬ(ЗаказПокупателяТовары.Ссылка.Комментарий КАК СТРОКА(1024)) КАК Комментарий
		|ПОМЕСТИТЬ ВТ_Подготовлена
		|ИЗ
		|	ВТ_Заказы КАК ВТ_Заказы
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказПокупателя.Товары КАК ЗаказПокупателяТовары
		|		ПО ВТ_Заказы.Заказ = ЗаказПокупателяТовары.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Подготовлена.Номенклатура,
		|	КОЛИЧЕСТВО(ВТ_Подготовлена1.Номенклатура) КАК НомерПозиции,
		|	ВТ_Подготовлена.Количество,
		|	ВТ_Подготовлена.НомерЗаказа,
		|	ВТ_Подготовлена.Комментарий
		|ИЗ
		|	ВТ_Подготовлена КАК ВТ_Подготовлена
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Подготовлена КАК ВТ_Подготовлена1
		|		ПО ВТ_Подготовлена.Номенклатура <= ВТ_Подготовлена1.Номенклатура
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_Подготовлена.Номенклатура,
		|	ВТ_Подготовлена.Количество,
		|	ВТ_Подготовлена.НомерЗаказа,
		|	ВТ_Подготовлена.Комментарий
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерПозиции";
		
		Запрос.УстановитьПараметр("Ссылка",ЭтотОбъект.Ссылка);
		
		ТЗ =Запрос.Выполнить().Выгрузить();
		

	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_АктПриемаПередачиТМЦ";
	
	ОбластьМакетаШапка = Макет.ПолучитьОбласть("Шапка");
	ТабДокумент.Вывести(ОбластьМакетаШапка);
	
	ОбластьМакетаЗаголовокТаблицы = Макет.ПолучитьОбласть("ЗаголовокТаблицы");
	ТабДокумент.Вывести(ОбластьМакетаЗаголовокТаблицы);
	
	ОбластьМакетаСтрокаТаблицы = Макет.ПолучитьОбласть("СтрокаТаблицы");
	
	Для каждого Стр из ТЗ Цикл
		
		ОбластьМакетаСтрокаТаблицы.Параметры.НомерПозиции = Стр.НомерПозиции ;
		ОбластьМакетаСтрокаТаблицы.Параметры.Номенклатура = Стр.Номенклатура ;
		ОбластьМакетаСтрокаТаблицы.Параметры.НомерЗаказа  = Стр.НомерЗаказа ;
		ОбластьМакетаСтрокаТаблицы.Параметры.Количество   = Стр.Количество ;
		ОбластьМакетаСтрокаТаблицы.Параметры.Комментарий  = Стр.Комментарий ;
		ТабДокумент.Вывести(ОбластьМакетаСтрокаТаблицы); 
		
	КонецЦикла;	
	
	ОбластьМакетаОтветственныеЛица = Макет.ПолучитьОбласть("ОтветственныеЛица");
	ОбластьМакетаОтветственныеЛица.Параметры.Дата = Формат(Дата,"ДФ=dd.MM.yyyy");
	ТабДокумент.Вывести(ОбластьМакетаОтветственныеЛица);
	
	
	ОбластьМакетаЛинияОтрыва = Макет.ПолучитьОбласть("ЛинияОтрыва");
	ТабДокумент.Вывести(ОбластьМакетаЛинияОтрыва);
	
	ОбластьМакетаШапкаВодителю = Макет.ПолучитьОбласть("ШапкаВодителю");
	ТабДокумент.Вывести(ОбластьМакетаШапкаВодителю);
	
	ОбластьМакетаЗаголовокТаблицыВодителю = Макет.ПолучитьОбласть("ЗаголовокТаблицыВодителю");
	ТабДокумент.Вывести(ОбластьМакетаЗаголовокТаблицыВодителю);
	
	
	ОбластьМакетаСтрокаТаблицыВодителю = Макет.ПолучитьОбласть("СтрокаТаблицыВодителю");
	
	Для каждого Стр из ТЗ Цикл
		
		ОбластьМакетаСтрокаТаблицыВодителю.Параметры.НомерПозиции = Стр.НомерПозиции ;
		ОбластьМакетаСтрокаТаблицыВодителю.Параметры.Номенклатура = Стр.Номенклатура ;
		ОбластьМакетаСтрокаТаблицыВодителю.Параметры.НомерЗаказа  = Стр.НомерЗаказа ;
		ОбластьМакетаСтрокаТаблицыВодителю.Параметры.Количество   = Стр.Количество ;
		ОбластьМакетаСтрокаТаблицыВодителю.Параметры.Комментарий  = Стр.Комментарий ;
		ТабДокумент.Вывести(ОбластьМакетаСтрокаТаблицыВодителю); 
		
	КонецЦикла;	
	
	ОбластьМакетаОтветственныеЛицаВодитель = Макет.ПолучитьОбласть("ОтветственныеЛицаВодитель");
	ОбластьМакетаОтветственныеЛицаВодитель.Параметры.Дата = Формат(Дата,"ДФ=dd.MM.yyyy");
	ТабДокумент.Вывести(ОбластьМакетаОтветственныеЛицаВодитель);
	
	//---------------------------------------------------
	ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц(); 
	
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабДокумент.АвтоМасштаб = Истина;
	
	Возврат ТабДокумент;
	
КонецФункции 

#КонецОбласти

#КонецЕсли
